{
  "apple": {
    "desc": "The apple, a popular fruit, is enjoyed globally. In India, it's a crisp, juicy fruit, rich in vitamins and antioxidants, often eaten fresh or used in desserts.",
    "price": "₹150-₹250",
    "season": "Rabi",
    "tips": "Provide well-drained soil and adequate chilling hours for better fruit production. Consider grafting for disease resistance.",
    "image": "rsc/image-crop/apple.jpg"
  },
  "banana": {
    "desc": "The banana is a long, curved fruit with a soft, sweet flesh, encased in a yellow peel. It's a popular and nutritious fruit enjoyed worldwide.",
    "price": "₹30-₹60",
    "season": "Kharif",
    "tips": "Ensure proper drainage and use organic fertilizers for optimal growth. Control pests with timely applications of appropriate pesticides.",
    "image": "rsc/image-crop/banana.jpg"
  },
  "blackgram": {
    "desc": "Blackgram, also known as urad dal, is a protein-rich legume widely consumed in India, used in various dishes and is important for soil health.",
    "price": "₹80-₹120",
    "season": "Kharif",
    "tips": "Use well-drained soil and practice timely irrigation. Implement integrated pest management techniques.",
    "image": "rsc/image-crop/blackgram.jpg"
  },
  "chickpea": {
    "desc": "Chickpea, a legume, is a staple food in India, known for its protein and fiber content. It's used in various dishes, from curries to snacks.",
    "price": "₹70-90",
    "season": "Rabi",
    "tips": "Ensure proper soil drainage; apply phosphorus fertilizer for optimal growth and yield.",
    "image": "rsc/image-crop/chickpea.jpg"
  },
  "coconut": {
    "desc": "The coconut, a tropical fruit, provides water, milk, oil, and fiber. It's a versatile food source and ingredient, popular in various cuisines.",
    "price": "₹35-₹55",
    "season": "Kharif",
    "tips": "Ensure proper drainage to prevent root rot. Intercrop with legumes to improve soil fertility.",
    "image": "rsc/image-crop/coconut.jpg"
  },
  "coffee": {
    "desc": "Coffee, a globally loved beverage, is made from roasted coffee beans. It is a popular stimulant with a rich aroma and diverse flavor profiles.",
    "price": "₹400-₹800",
    "season": "Kharif",
    "tips": "Provide shade to coffee plants and ensure proper drainage to prevent waterlogging.",
    "image": "rsc/image-crop/coffee.jpg"
  },
  "cotton": {
    "desc": "Cotton is a soft, fluffy staple fiber that grows in a boll, or protective case, around the seeds of the cotton plants, used for textile.",
    "price": "₹60-80",
    "season": "Kharif",
    "tips": "Control pests and diseases with integrated pest management; ensure proper irrigation and drainage.",
    "image": "rsc/image-crop/cotton.jpg"
  },
  "grapes": {
    "desc": "Grapes are juicy, sweet fruits that grow in bunches. They are a popular snack and used in winemaking, providing essential vitamins and antioxidants.",
    "price": "₹150-₹300",
    "season": "Rabi",
    "tips": "Ensure proper pruning for airflow and sunlight. Monitor for pests and diseases regularly.",
    "image": "rsc/image-crop/grapes.jpg"
  },
  "jute": {
    "desc": "Jute is a long, soft, shiny bast fiber spun into coarse, strong threads, used for burlap, sacks, and other textiles. Cultivated mainly for its fiber.",
    "price": "₹55-65",
    "season": "Kharif",
    "tips": "Ensure proper drainage and use certified seeds for higher yields. Control pests and diseases early for better fiber quality.",
    "image": "rsc/image-crop/jute.jpg"
  },
  "kidneybeans": {
    "desc": "Kidney beans, also known as rajma, are a staple in Indian cuisine. These red, kidney-shaped beans are known for their protein and fiber content.",
    "price": "80-120",
    "season": "Kharif",
    "tips": "Ensure proper drainage to prevent root rot. Apply organic fertilizers during the growing phase for better yields.",
    "image": "rsc/image-crop/kidneybeans.jpg"
  },
  "lentil": {
    "desc": "Lentils are a protein-rich pulse, a staple in Indian cuisine, known for their quick cooking time and versatility in various dishes.",
    "price": "₹70-₹90",
    "season": "Rabi",
    "tips": "Ensure proper drainage to prevent root rot. Use disease-resistant varieties for better yields.",
    "image": "rsc/image-crop/lentil.jpg"
  },
  "maize": {
    "desc": "Maize, also known as corn, is a cereal grain widely cultivated for food, animal feed, and industrial purposes. It's a staple crop globally, including in India.",
    "price": "20-28",
    "season": "Kharif",
    "tips": "Ensure proper drainage and use certified seeds for higher yields.",
    "image": "rsc/image-crop/maize.jpg"
  },
  "mango": {
    "desc": "The mango, a tropical fruit, is beloved for its sweet, juicy flesh and vibrant color. India is a major producer, cultivating diverse varieties.",
    "price": "₹50 - ₹150",
    "season": "Summer (typically Zaid)",
    "tips": "Provide proper irrigation and drainage. Control pests with integrated pest management techniques.",
    "image": "rsc/image-crop/mango.jpg"
  },
  "mothbeans": {
    "desc": "Moth beans are drought-resistant legumes, primarily cultivated in arid regions of India, known for their nutritional value and ability to fix nitrogen.",
    "price": "₹60 - ₹80",
    "season": "Kharif",
    "tips": "Use certified seeds for better yields and ensure proper drainage to prevent waterlogging.",
    "image": "rsc/image-crop/mothbeans.jpg"
  },
  "mungbean": {
    "desc": "Mungbean, a legume, is a quick-growing crop, popular for its protein-rich sprouts and seeds. It's a key ingredient in various Indian dishes.",
    "price": "₹80 - ₹120",
    "season": "Kharif",
    "tips": "Ensure well-drained soil and treat seeds with bio-agents for disease control.",
    "image": "rsc/image-crop/mungbean.jpg"
  },
  "muskmelon": {
    "desc": "Muskmelon, a sweet and juicy summer fruit, is known for its refreshing taste and vibrant orange flesh. It's a popular choice for hydrating and enjoying during hot weather.",
    "price": "₹30-50",
    "season": "Zaid",
    "tips": "Choose well-drained soil and provide adequate sunlight. Monitor for pests and diseases, employing timely control measures.",
    "image": "rsc/image-crop/muskmelon.jpg"
  },
  "orange": {
    "desc": "Oranges, a citrus fruit, are known for their sweet and tangy taste. They are a good source of Vitamin C and enjoyed widely across India.",
    "price": "₹50 - ₹80",
    "season": "Rabi",
    "tips": "Ensure proper drainage to prevent root rot. Implement regular pest and disease management practices.",
    "image": "rsc/image-crop/orange.jpg"
  },
  "papaya": {
    "desc": "Papaya is a tropical fruit known for its sweet, juicy flesh and numerous health benefits. It's rich in vitamins and enzymes, enjoyed ripe or used green in cooking.",
    "price": "₹30-₹50",
    "season": "Kharif",
    "tips": "Ensure well-drained soil and provide consistent irrigation. Protect young plants from strong winds and frost.",
    "image": "rsc/image-crop/papaya.jpg"
  },
  "pigeonpeas": {
    "desc": "Pigeonpeas, also known as arhar or toor dal, are a drought-resistant legume, a staple in Indian cuisine, and a source of protein and fiber.",
    "price": "80-120",
    "season": "Kharif",
    "tips": "Use disease-resistant varieties and ensure proper drainage to prevent waterlogging which can negatively impact crop yield.",
    "image": "rsc/image-crop/pigeonpeas.jpg"
  },
  "pomegranate": {
    "desc": "Pomegranate, a nutrient-rich fruit, is known for its juicy arils and unique taste. It's a popular choice for fresh consumption and processing across India.",
    "price": "₹100-150",
    "season": "Kharif",
    "tips": "Ensure proper irrigation and drainage. Implement timely pest and disease control measures for a healthy yield.",
    "image": "rsc/image-crop/pomegranate.jpg"
  },
  "rice": {
    "desc": "Rice, a staple grain, provides sustenance globally. In India, it's a cornerstone of diets, cultivated across diverse regions with varying varieties.",
    "price": "₹35-₹60",
    "season": "Kharif",
    "tips": "Ensure proper water management and use certified seeds for higher yields and disease resistance.",
    "image": "rsc/image-crop/rice.jpg"
  },
  "watermelon": {
    "desc": "Watermelon is a large, juicy fruit, primarily composed of water, with a sweet, refreshing taste, popular during the summer months.",
    "price": "₹20-₹40",
    "season": "Zaid",
    "tips": "Choose well-draining soil and provide ample sunlight. Regular watering is essential for optimal fruit development.",
    "image": "rsc/image-crop/watermelon.jpg"
  }
}